implement-verify-service/test-results/java-repo/pipeline-output/java-design-patterns/test/diagrams/inheritance-tree.dot
digraph Inheritance_Tree {
    rankdir=TB;

    AbstractDocument [label="AbstractDocument", shape=record];
    Document [label="Document", shape=record];
    Car [label="Car", shape=record];
    HasModel [label="HasModel", shape=record];
    HasPrice [label="HasPrice", shape=record];
    HasParts [label="HasParts", shape=record];
    HasType [label="HasType", shape=record];
    Part [label="Part", shape=record];
    DocumentImplementation [label="DocumentImplementation", shape=record];
    App [label="App", shape=record];
    Runnable [label="Runnable", shape=record];
    ElfArmy [label="ElfArmy", shape=record];
    Army [label="Army", shape=record];
    ElfCastle [label="ElfCastle", shape=record];
    Castle [label="Castle", shape=record];
    ElfKing [label="ElfKing", shape=record];
    King [label="King", shape=record];
    ElfKingdomFactory [label="ElfKingdomFactory", shape=record];
    KingdomFactory [label="KingdomFactory", shape=record];
    OrcArmy [label="OrcArmy", shape=record];
    OrcCastle [label="OrcCastle", shape=record];
    OrcKing [label="OrcKing", shape=record];
    OrcKingdomFactory [label="OrcKingdomFactory", shape=record];
    Orc [label="Orc", shape=record];
    ActiveCreature [label="ActiveCreature", shape=record];
    Actor [label="Actor", shape=record];
    ExampleActor [label="ExampleActor", shape=record];
    ExampleActor2 [label="ExampleActor2", shape=record];
    AllModemVisitor [label="AllModemVisitor", shape=record];
    ZoomVisitor [label="ZoomVisitor", shape=record];
    HayesVisitor [label="HayesVisitor", shape=record];
    ConfigureForDosVisitor [label="ConfigureForDosVisitor", shape=record];
    ConfigureForUnixVisitor [label="ConfigureForUnixVisitor", shape=record];
    Hayes [label="Hayes", shape=record];
    Modem [label="Modem", shape=record];
    ModemVisitor [label="ModemVisitor", shape=record];
    Zoom [label="Zoom", shape=record];

    Document -> AbstractDocument [];
    AbstractDocument -> Car [];
    HasModel -> Car [];
    HasPrice -> Car [];
    HasParts -> Car [];
    Document -> HasModel [];
    Document -> HasParts [];
    Document -> HasPrice [];
    Document -> HasType [];
    AbstractDocument -> Part [];
    HasType -> Part [];
    HasModel -> Part [];
    HasPrice -> Part [];
    AbstractDocument -> DocumentImplementation [];
    Runnable -> App [];
    Army -> ElfArmy [];
    Castle -> ElfCastle [];
    King -> ElfKing [];
    KingdomFactory -> ElfKingdomFactory [];
    Army -> OrcArmy [];
    Castle -> OrcCastle [];
    King -> OrcKing [];
    KingdomFactory -> OrcKingdomFactory [];
    ActiveCreature -> Orc [];
    Runnable -> Actor [];
    Actor -> ExampleActor [];
    Actor -> ExampleActor2 [];
    ZoomVisitor -> AllModemVisitor [];
    HayesVisitor -> AllModemVisitor [];
    AllModemVisitor -> ConfigureForDosVisitor [];
    ZoomVisitor -> ConfigureForUnixVisitor [];
    Modem -> Hayes [];
    ModemVisitor -> HayesVisitor [];
    Modem -> Zoom [];
}
